---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooFewParamsForSketch
source: html/07b40b41-2cdb-2e02-a6da-43af23da36f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooFewParamsForSketch Property

The sketched Structural Rebar element has too many segments to be properly parameterized. Please reduce the number of segments.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooFewParamsForSketch { get; }
```